ElecStar-ir/EffectiveMultiMicrocontrollerFramework-Basic/EMF_CPP_CORE/EMF.MCU.IAR__HAL__F0__STM32F030X6__STM32F030F4P6.h
/**
 ******************************************************************************************
 * This file is part of EMF(Effective Multi Microcontroller Framework).
 *
 * @author  Ebrahim Rahmanian (elecstar.ir@gmail.com) (www.elecstar.ir)
 * @brief
 ******************************************************************************************
 * @attention
 *
 ******************************************************************************************
 * @RELEASE HISTORY
 *
 * DATE                     NAME           DESCRIPTION
 * v4.0_14020803            E.Rahmanian    Create
 * v5.0.1_14031028			E.Rahmanian    Optimize
 * v5.0.2_14031028			E.Rahmanian    Comment Fixed
 * v5.2_14050505            E.Rahmanian    Fixed => add "extern "C" {" and __cplusplus"
 ******************************************************************************************
 */
#if defined(IAR__HAL__F0__STM32F030X6__STM32F030F4P6)
#ifndef EMF_MCU_IAR__HAL__F0__STM32F030X6__STM32F030F4P6_H
#define EMF_MCU_IAR__HAL__F0__STM32F030X6__STM32F030F4P6_H

    #define EMF_MCU_SELECTED (1)
    #include <complex.h>
    #include <ctype.h>
    #include <float.h>
    #include <math.h>
    #include <stdbool.h>
    #include <stdint.h>
    #include <string.h>
    #include <stdint.h>
    #include <stdio.h>
    #include <stdlib.h>
    #include <uchar.h>
    #include <wchar.h>
    #include <wctype.h>

    #ifdef __cplusplus
    extern "C" {
    #endif

        #include "stm32f0xx_hal.h"
        
    #ifdef __cplusplus
    }
    #endif

    //Family DNA!
    #define IAR__HAL__F0__STM32F030X6 (1)

    //Group DNA!
    #define IAR__HAL__F0 (1)

    //Driver DNA!
    #define IAR__HAL (1)

    //IDE DNA!
    #define IAR (1)

    //Parts Of MCU DNA!
    #define EMF__IDE_IAR (1)
    #define EMF__DRIVER_HAL (1)
    #define EMF__GROUP_F0 (1)
    #define EMF__FAMILY_STM32F030X6 (1)  // STM32F030F4, STM32F030C6, STM32F030K6
    #define EMF__MCU_STM32F030F4P6 (1)
    
#endif
#endif